
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 14 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sdp-database-flexible
  * azurerm_key_vault_secret.sdp-host-flexible
  * azurerm_key_vault_secret.sdp-port-flexible
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.sdp-database
  * azurerm_key_vault_secret.sdp-host
  * azurerm_key_vault_secret.sdp-port
  * azurerm_key_vault_secret.secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.secret[&#34;USER&#34;]
  * module.database.azurerm_postgresql_server.postgres-paas
* Delete
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-01T09:06:54Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-DATABASE/a488df034fcd4fb5b1c0dd8419fa9d32"
        name                    = "account-management-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-01T09:06:54Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-HOST/2fda2f3320e649b28bbaa27457d7b25f"
        name                    = "account-management-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-01T09:06:54Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-PASS/079f62847b2040e2bb57475cf96ab219"
        name                    = "account-management-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-01T09:06:54Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-PORT/abf10b35129d4428b7108f616dae6cec"
        name                    = "account-management-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-01T09:06:54Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-USER/2655fc2c75e94e549d19337152ffc7ae"
        name                    = "account-management-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-database will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-database" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-DATABASE/c97a1b08f6954efda1a16a0c6dad823a"
        name                    = "account-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-database-flexible will be created
  + resource "azurerm_key_vault_secret" "sdp-database-flexible" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sdp-host will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-host" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-HOST/aea7bdc5785448cfaec4cb555d408bf3"
        name                    = "account-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-host-flexible will be created
  + resource "azurerm_key_vault_secret" "sdp-host-flexible" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sdp-port will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-port" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PORT/4c200b3100d3422d9080f55523497219"
        name                    = "account-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-port-flexible will be created
  + resource "azurerm_key_vault_secret" "sdp-port-flexible" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-DATABASE/8ce251ec48bd4777a94507a628072ef9"
        name                    = "account-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-HOST/2859e2b055944522b249294cf60009ce"
        name                    = "account-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PASS/ababb47721794d178d902704500de779"
        name                    = "account-management-POSTGRES-PASS"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PORT/a1035a13a62042d29439c00331f8644b"
        name                    = "account-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-01T08:59:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-USER/b97f01708c6144a983fd4b46755db2f4"
        name                    = "account-management-POSTGRES-USER"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # postgresql_grant.readonly_mv has moved to postgresql_grant.readonly_mv[0]
    resource "postgresql_grant" "readonly_mv" {
        id                = "sdp-account-management_accountmanagement_public_table_sdp_mat_view_pi_user"
        # (7 unchanged attributes hidden)
    }

  # postgresql_role.create_sdp_access has moved to postgresql_role.create_sdp_access[0]
    resource "postgresql_role" "create_sdp_access" {
        id                                  = "sdp-account-management"
        name                                = (sensitive value)
        # (17 unchanged attributes hidden)
    }

  # module.database.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.DBforPostgreSQL/servers/pip-account-management-staging"
        name                              = "pip-account-management-staging"
        tags                              = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/flexible-pip-account-management-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-account-management-stg"
      + value     = "plpgsql, pg_stat_statements, pg_buffercache"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be destroyed
  # (because key ["backslash_quote"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      - id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/flexible-pip-account-management-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-account-management-stg/configurations/backslash_quote" -> null
      - name      = "backslash_quote" -> null
      - server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/flexible-pip-account-management-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-account-management-stg" -> null
      - value     = "on" -> null
    }

Plan: 4 to add, 14 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":355,"Program":"tfcmt","SHA1":"","Vars":{}} -->